jwy8612/monitor/software/header/_ioUSB646to1287v.h
/* Pin Change Interrupts */
#define PCIFR	(*(volatile unsigned char *)0x3B)
#define  PCIF0    0
#define PCICR	(*(volatile unsigned char *)0x68)
#define  PCIE0    0
#define PCMSK0	(*(volatile unsigned char *)0x6B)

/* eXternal Memory Control Register */
#define XMCRB	(*(volatile unsigned char *)0x75)
#define  XMBK     7
#define  XMM2     2
#define  XMM1     1
#define  XMM0     0
#define XMCRA	(*(volatile unsigned char *)0x74)
#define  SRE      7
#define  SRL2     6
#define  SRL1     5
#define  SRL0     4
#define  SRW11    3
#define  SRW10    2
#define  SRW01    1
#define  SRW00    0

/* GPIO */
#define GPIOR0	(*(volatile unsigned char *)0x3E)
#define GPIOR1	(*(volatile unsigned char *)0x4A)
#define GPIOR2	(*(volatile unsigned char *)0x4B)

/* RAM page Z-pointer */
#define RAMPZ	(*(volatile unsigned char *)0x5B)

/* Stack Pointer */
#define SP  	(*(volatile unsigned int *)0x5D)
#define SPL 	(*(volatile unsigned char *)0x5D)
#define SPH 	(*(volatile unsigned char *)0x5E)

/* Status REGister */
#define SREG	(*(volatile unsigned char *)0x5F)


/* io bits */

/* Port A */
#define  PORTA7   7
#define  PORTA6   6
#define  PORTA5   5
#define  PORTA4   4
#define  PORTA3   3
#define  PORTA2   2
#define  PORTA1   1
#define  PORTA0   0
#define  PA7      7
#define  PA6      6
#define  PA5      5
#define  PA4      4
#define  PA3      3
#define  PA2      2
#define  PA1      1
#define  PA0      0
#define  DDA7     7
#define  DDA6     6
#define  DDA5     5
#define  DDA4     4
#define  DDA3     3
#define  DDA2     2
#define  DDA1     1
#define  DDA0     0
#define  PINA7    7
#define  PINA6    6
#define  PINA5    5
#define  PINA4    4
#define  PINA3    3
#define  PINA2    2
#define  PINA1    1
#define  PINA0    0

/* Port B */
#define  PORTB7   7
#define  PORTB6   6
#define  PORTB5   5
#define  PORTB4   4
#define  PORTB3   3
#define  PORTB2   2
#define  PORTB1   1
#define  PORTB0   0
#define  PB7      7
#define  PB6      6
#define  PB5      5
#define  PB4      4
#define  PB3      3
#define  PB2      2
#define  PB1      1
#define  PB0      0
#define  DDB7     7
#define  DDB6     6
#define  DDB5     5
#define  DDB4     4
#define  DDB3     3
#define  DDB2     2
#define  DDB1     1
#define  DDB0     0
#define  PINB7    7
#define  PINB6    6
#define  PINB5    5
#define  PINB4    4
#define  PINB3    3
#define  PINB2    2
#define  PINB1    1
#define  PINB0    0

/* Port C */
#define  PORTC7   7
#define  PORTC6   6
#define  PORTC5   5
#define  PORTC4   4
#define  PORTC3   3
#define  PORTC2   2
#define  PORTC1   1
#define  PORTC0   0
#define  PC7      7
#define  PC6      6
#define  PC5      5
#define  PC4      4
#define  PC3      3
#define  PC2      2
#define  PC1      1
#define  PC0      0
#define  DDC7     7
#define  DDC6     6
#define  DDC5     5
#define  DDC4     4
#define  DDC3     3
#define  DDC2     2
#define  DDC1     1
#define  DDC0     0
#define  PINC7    7
#define  PINC6    6
#define  PINC5    5
#define  PINC4    4
#define  PINC3    3
#define  PINC2    2
#define  PINC1    1
#define  PINC0    0

/* Port D */
#define  PORTD7   7
#define  PORTD6   6
#define  PORTD5   5
#define  PORTD4   4
#define  PORTD3   3
#define  PORTD2   2
#define  PORTD1   1
#define  PORTD0   0
#define  PD7      7
#define  PD6      6
#define  PD5      5
#define  PD4      4
#define  PD3      3
#define  PD2      2
#define  PD1      1
#define  PD0      0
#define  DDD7     7
#define  DDD6     6
#define  DDD5     5
#define  DDD4     4
#define  DDD3     3
#define  DDD2     2
#define  DDD1     1
#define  DDD0     0
#define  PIND7    7
#define  PIND6    6
#define  PIND5    5
#define  PIND4    4
#define  PIND3    3
#define  PIND2    2
#define  PIND1    1
#define  PIND0    0

/* Port E */
#define  PORTE7   7
#define  PORTE6   6
#define  PORTE5   5
#define  PORTE4   4
#define  PORTE3   3
#define  PORTE2   2
#define  PORTE1   1
#define  PORTE0   0
#define  PE7      7
#define  PE6      6
#define  PE5      5
#define  PE4      4
#define  PE3      3
#define  PE2      2
#define  PE1      1
#define  PE0      0
#define  DDE7     7
#define  DDE6     6
#define  DDE5     5
#define  DDE4     4
#define  DDE3     3
#define  DDE2     2
#define  DDE1     1
#define  DDE0     0
#define  PINE7    7
#define  PINE6    6
#define  PINE5    5
#define  PINE4    4
#define  PINE3    3
#define  PINE2    2
#define  PINE1    1
#define  PINE0    0

/* Port F */
#define  PORTF7   7
#define  PORTF6   6
#define  PORTF5   5
#define  PORTF4   4
#define  PORTF3   3
#define  PORTF2   2
#define  PORTF1   1
#define  PORTF0   0
#define  PF7      7
#define  PF6      6
#define  PF5      5
#define  PF4      4
#define  PF3      3
#define  PF2      2
#define  PF1      1
#define  PF0      0
#define  DDF7     7
#define  DDF6     6
#define  DDF5     5
#define  DDF4     4
#define  DDF3     3
#define  DDF2     2
#define  DDF1     1
#define  DDF0     0
#define  PINF7    7
#define  PINF6    6
#define  PINF5    5
#define  PINF4    4
#define  PINF3    3
#define  PINF2    2
#define  PINF1    1
#define  PINF0    0

/* PCMSK0 */
#define  PCINT7   7
#define  PCINT6   6
#define  PCINT5   5
#define  PCINT4   4
#define  PCINT3   3
#define  PCINT2   2
#define  PCINT1   1
#define  PCINT0   0


/* USB io (all memory mapped)*/

#define UHCON	(*(volatile unsigned char *)0x9E)
#define  RESUME   2
#define  RESET    1
#define  SOFEN    0
#define UHINT	(*(volatile unsigned char *)0x9F)
#define  HWUPI    6
#define  HWUP     6
#define  HSOFI    5
#define  HSOF     5
#define  RXRSMI   4
#define  RSMEDI   3
#define  RSTI     2
#define  DDISCI   1
#define  DCONNI   0
#define UHIEN	(*(volatile unsigned char *)0xA0)
#define  HWUPE    6
#define  HSOFE    5
#define  RXRSME   4
#define  RSMEDE   3
#define  RSTE     2
#define  DDISCE   1
#define  DCONNE   0
#define UHADDR	(*(volatile unsigned char *)0xA1)
#define UHFNUM	(*(volatile unsigned int *)0xA2)
#define UHFNUML	(*(volatile unsigned char *)0xA2)
#define UHFNUMH	(*(volatile unsigned char *)0xA3)
#define UHFLEN	(*(volatile unsigned char *)0xA4)

#define UPINRQX	(*(volatile unsigned char *)0xA5)
#define UPINTX	(*(volatile unsigned char *)0xA6)
#define  FIFOCON  7
#define  NAKEDI   6
#define  RWAL     5
#define  PERRI    4
#define  TXSTPI   3
#define  TXOUTI   2
#define  RXSTALLI 1
#define  CRCERR   1
#define  RXINI    0
#define UPNUM	(*(volatile unsigned char *)0xA7)
#define UPRST	(*(volatile unsigned char *)0xA8)
#define  P6RST    6
#define  P5RST    5
#define  P4RST    4
#define  P3RST    3
#define  P2RST    2
#define  P1RST    1
#define  P0RST    0
#define UPCONX	(*(volatile unsigned char *)0xA9)
#define  PFREEZE  6
#define  INMODE   5
#define  RSTDT    3
#define  PEN      0
#define UPCFG0X	(*(volatile unsigned char *)0xAA)
#define  PTYPE1   7
#define  PTYPE0   6
#define  PTOKEN1  5
#define  PTOKEN0  4
#define  PEPNUM3  3
#define  PEPNUM2  2
#define  PEPNUM1  1
#define  PEPNUM0  0
#define UPCFG1X	(*(volatile unsigned char *)0xAB)
#define  PSIZE2   6
#define  PSIZE1   5
#define  PSIZE0   4
#define  PBK1     3
#define  PBK0     2
#define  ALLOC    1
#define UPSTAX	(*(volatile unsigned char *)0xAC)
#define  CFGOK    7
#define  OVERFI   6
#define  UNDERFI  5
#define  DTSEQ1   3
#define  DTSEQ0   2
#define  NBUSYBK1 1
#define  NBUSYBK0 0
#define UPCFG2X	(*(volatile unsigned char *)0xAD)
#define UPIENX	(*(volatile unsigned char *)0xAE)
#define  FLERRE   7
#define  NAKEDE   6
#define  PERRE    4
#define  TXSTPE   3
#define  TXOUTE   2
#define  RXSTALLE 1
#define  RXINE    0
#define UPDATX	(*(volatile unsigned char *)0xAF)

#define UHWCON	(*(volatile unsigned char *)0xD7)
#define  UIMOD    7
#define  UIDE     6
#define  UVCONE   4
#define  UVREGE   0
#define USBCON	(*(volatile unsigned char *)0xD8)
#define  USBE     7
#define  HOST     6
#define  FRZCLK   5
#define  OTGPADE  4
#define  IDTE     1
#define  VBUSTE   0
#define USBSTA	(*(volatile unsigned char *)0xD9)
#define  SPEED    3
#define  ID       1
#define  VBUS     0
#define USBINT	(*(volatile unsigned char *)0xDA)
#define  IDTI     1
#define  VBUSTI   0

#define OTGCON	(*(volatile unsigned char *)0xDD)
#define  HNPREQ   5
#define  SRPREQ   4
#define  SRPSEL   3
#define  VBUSHWC  2
#define  VBUSREQ  1
#define  VBUSRQC  0
#define OTGIEN	(*(volatile unsigned char *)0xDE)
#define  STOE     5
#define  HNPERRE  4
#define  ROLEEXE  3
#define  BCERRE   2
#define  VBERRE   1
#define  SRPE     0
#define OTGINT	(*(volatile unsigned char *)0xDF)
#define  STOI     5
#define  HNPERRI  4
#define  ROLEEXI  3
#define  BCERRI   2
#define  VBERRI   1
#define  SRPI     0

