jwy8612/monitor/software/header/_ioUSB646to1287v.h
#define UDCON	(*(volatile unsigned char *)0xE0)
#define  LSM      2
#define  RMWKUP   1
#define  DETACH   0
#define UDINT	(*(volatile unsigned char *)0xE1)
#define  UPRSMI   6
#define  EORSMI   5
#define  WAKEUPI  4
#define  EORSTI   3
#define  SOFI     2
/* #define  MSOFI    1 */ /* this one is in register summary only */
#define  SUSPI    0
#define UDIEN	(*(volatile unsigned char *)0xE2)
#define  UPRSME   6
#define  EORSME   5
#define  WAKEUPE  4
#define  EORSTE   3
#define  SOFE     2
/* #define  MSOFE    1 */ /* this one is in register summary only */
#define  SUSPE    0
#define UDADDR	(*(volatile unsigned char *)0xE3)
#define  ADDEN    7
#define UDFNUM	(*(volatile unsigned int *)0xE4)
#define UDFNUML	(*(volatile unsigned char *)0xE4)
#define UDFNUMH	(*(volatile unsigned char *)0xE5)
#define UDMFN	(*(volatile unsigned char *)0xE6)
#define  FNCERR   4

#define UEINTX	(*(volatile unsigned char *)0xE8)
#define  FIFOCON  7
#define  NAKINI   6
#define  RWAL     5
#define  NAKOUTI  4
#define  RXSTPI   3
#define  RXOUTI   2
#define  STALLEDI 1
#define  TXINI    0
#define UENUM	(*(volatile unsigned char *)0xE9)
#define UERST	(*(volatile unsigned char *)0xEA)
#define  EPRST6   6
#define  EPRST5   5
#define  EPRST4   4
#define  EPRST3   3
#define  EPRST2   2
#define  EPRST1   1
#define  EPRST0   0
#define UECONX	(*(volatile unsigned char *)0xEB)
#define  STALLRQ  5
#define  STALLRQC 4
#define  RSTDT    3
#define  EPEN     0
#define UECFG0X	(*(volatile unsigned char *)0xEC)
#define  EPTYPE1  7
#define  EPTYPE0  6
#define  EPDIR    0
#define UECFG1X	(*(volatile unsigned char *)0xED)
#define  EPSIZE2  6
#define  EPSIZE1  5
#define  EPSIZE0  4
#define  EPBK1    3
#define  EPBK0    2
#define  ALLOC    1
#define UESTA0X	(*(volatile unsigned char *)0xEE)
#define  CFGOK    7
#define  OVERFI   6
#define  UNDERFI  5
#define  DTSEQ1   3
#define  DTSEQ0   2
#define  NBUSYBK1 1
#define  NBUSYBK0 0
#define UESTA1X	(*(volatile unsigned char *)0xEF)
#define  CTRLDIR  2
#define  CURRBK1  1
#define  CURRBK0  0
#define UEIENX	(*(volatile unsigned char *)0xF0)
#define  FLERRE   7
#define  NAKINE   6
#define  NAKOUTE  4
#define  RXSTPE   3
#define  RXOUTE   2
#define  STALLEDE 1
#define  TXINE    0
#define UEDATX	(*(volatile unsigned char *)0xF1)
#define UEBCX	(*(volatile unsigned int *)0xF2)
#define UEBCLX	(*(volatile unsigned char *)0xF2)
#define UEBCHX	(*(volatile unsigned char *)0xF3)
#define UEINT	(*(volatile unsigned char *)0xF4)
#define  EPINT6   6
#define  EPINT5   5
#define  EPINT4   4
#define  EPINT3   3
#define  EPINT2   2
#define  EPINT1   1
#define  EPINT0   0

#define UPERRX	(*(volatile unsigned char *)0xF5)
#define  COUNTER1 6
#define  COUNTER0 5
#define  CRC16    4
#define  TIMEOUT  3
#define  PID      2
#define  DATAPID  1
#define  DATATGL  0
#define UPBCX	(*(volatile unsigned int *)0xF6)
#define UPBCLX	(*(volatile unsigned char *)0xF6)
#define UPBCHX	(*(volatile unsigned char *)0xF7)
#define UPINT	(*(volatile unsigned char *)0xF8)
#define  PINT6    6
#define  PINT5    5
#define  PINT4    4
#define  PINT3    3
#define  PINT2    2
#define  PINT1    1
#define  PINT0    0

#define OTGTCON	(*(volatile unsigned char *)0xF9)
#define  PAGE1    6
#define  PAGE0    5
#define  VALUE1   1
#define  VALUE0   0


/* Lock and Fuse Bits with LPM/SPM instructions */

/* lock bits */
#define  BLB12    5
#define  BLB11    4
#define  BLB02    3
#define  BLB01    2
#define  LB2      1
#define  LB1      0

/* fuses low bits */
#define  CKDIV8   7
#define  CKOUT    6
#define  SUT1     5
#define  SUT0     4
#define  CKSEL3   3
#define  CKSEL2   2
#define  CKSEL1   1
#define  CKSEL0   0

/* fuses high bits */
#define  OCDEN    7
#define  JTAGEN   6
#define  SPIEN    5
#define  WDTON    4
#define  EESAVE   3
#define  BOOTSZ1  2
#define  BOOTSZ0  1
#define  BOOTRST  0

/* extended fuses */
#define  HWBE      3
#define  BODLEVEL2 2
#define  BODLEVEL1 1
#define  BODLEVEL0 0


/* Interrupt Vector Numbers */

#define iv_RESET        1
#define iv_INT0         2
#define iv_EXT_INT0     2
#define iv_INT1         3
#define iv_EXT_INT1     3
#define iv_INT2         4
#define iv_EXT_INT2     4
#define iv_INT3         5
#define iv_EXT_INT3     5
#define iv_INT4         6
#define iv_EXT_INT4     6
#define iv_INT5         7
#define iv_EXT_INT5     7
#define iv_INT6         8
#define iv_EXT_INT6     8
#define iv_INT7         9
#define iv_EXT_INT7     9
#define iv_PCINT0       10
#define iv_USB_GENERAL  11
#define iv_USB_GEN      11
#define iv_USB_END_PIPE 12
#define iv_USB_EP       12
#define iv_WDT          13
#define iv_TIMER2_COMPA 14
#define iv_TIMER2_COMPB 15
#define iv_TIMER2_OVF   16
#define iv_TIM2_COMPA   14
#define iv_TIM2_COMPB   15
#define iv_TIM2_OVF     16
#define iv_TIMER1_CAPT  17
#define iv_TIMER1_COMPA 18
#define iv_TIMER1_COMPB 19
#define iv_TIMER1_COMPC 20
#define iv_TIMER1_OVF   21
#define iv_TIM1_CAPT    17
#define iv_TIM1_COMPA   18
#define iv_TIM1_COMPB   19
#define iv_TIM1_COMPC   20
#define iv_TIM1_OVF     21
#define iv_TIMER0_COMPA 22
#define iv_TIMER0_COMPB 23
#define iv_TIMER0_OVF   24
#define iv_TIM0_COMPA   22
#define iv_TIM0_COMPB   23
#define iv_TIM0_OVF     24
#define iv_SPI_STC      25
#define iv_USART0_RX    26
#define iv_USART0_RXC   26
#define iv_USART0_DRE   27
#define iv_USART0_UDRE  27
#define iv_USART0_TX    28
#define iv_USART0_TXC   28
#define iv_USART1_RX    26
#define iv_USART1_RXC   26
#define iv_USART1_DRE   27
#define iv_USART1_UDRE  27
#define iv_USART1_TX    28
#define iv_USART1_TXC   28
#define iv_ANA_COMP     29
#define iv_ANALOG_COMP  29
#define iv_ADC          30
#define iv_EE_RDY       31
#define iv_EE_READY     31
#define iv_TIMER3_CAPT  32
#define iv_TIMER3_COMPA 33
#define iv_TIMER3_COMPB 34
#define iv_TIMER3_COMPC 35
#define iv_TIMER3_OVF   36
#define iv_TIM3_CAPT    32
#define iv_TIM3_COMPA   33
#define iv_TIM3_COMPB   34
#define iv_TIM3_COMPC   35
#define iv_TIM3_OVF     36
#define iv_TWI          37
#define iv_TWSI         37
#define iv_SPM_RDY      38
#define iv_SPM_READY    38

/*ja*/

#endif
